app/views/beers/show.html.erb


<% if @beer.ratings.empty? %>
---
SELECT 1 AS one FROM "ratings" WHERE "ratings"."beer_id" = ? LIMIT 1  [["beer_id", 7]]

<% else %>
  <p>has been rated <%= @beer.ratings.count %> times, average score <%= @beer.average_rating %></p>
---
SELECT AVG("ratings"."score") AS avg_id FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]