app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def index
    @breweries = Brewery.all

INSERT INTO "breweries" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Mon, 06 Jan 2014 17:48:10 UTC +00:00], ["name", "Koff"], ["updated_at", Mon, 06 Jan 2014 17:48:10 UTC +00:00], ["year", 1897]]
---
  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save

UPDATE "breweries" SET "name" = ?, "updated_at" = ? WHERE "breweries"."id" = 4  [["name", "BrewDog"], ["updated_at", Thu, 16 Jan 2014 19:41:59 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @brewery.update(brewery_params)

DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 5]]
---
  def destroy
    @brewery.destroy

SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", "5"]]
---
    def set_brewery
      @brewery = Brewery.find(params[:id])